const textNodes = [
    {
      id: 1,
      text: `*Alarm clock starts ringing*`,
      options: [
        {
          text: 'Stop alarm',
          nextText: 2,
          setState: beep
        }
      ]
    },
    {
      id: 2,
      text: `You reach for your alarm clock and press the button to turn off the loud ringing. Normally, you'd snooze the alarm and sleep for a few more minutes before officially turning off the alarm clock.`,
      options: [
        {
          text: 'Continue',
          nextText: 3
        }
      ]
    },
    {
      id: 3,
      text: `But this day is different. You were surprised how you were even able to fall asleep last night since you were feeling too excited by what's to come today. All your friends will come by to join and celebrate because today is your birthday!`,
      options: [
        {
          text: 'Continue',
          nextText: 4
        }
      ]
    },
    {
      id: 4,
      text: `And it's not just any normal birthday! Today is officially your 10th birthday, the day that you've been excitedly anticipating for throughout all these years ever since you first learned about Pokemon trainers. Today marks the day when you can finally venture out into the world to become the very best Pokemon trainer!`,
      options: [
        {
          text: 'Head downstairs',
          nextText: 5
        }
      ]
    },
    {
      id: 5,
      text: `You get up without any hesitation and hurriedly run downstairs to greet your mom. After reaching the first floor, you immediately notice the scent of pancakes and buttery goodness wafting through the air. You quickly head towards the kitchen to greet your mom.`,
      options: [
        {
          text: 'Head to kitchen',
          nextText: 6
        }
      ]
    },
    {
      id: 6,
      text: `Your eyes are immediately caught by the sight of pancakes drizzled with maple syrup and stacked neatly on a plate, placed on top of the kitchen table. On your left, you see your mom busily flipping some more pancakes by the stove. You greet her, but she doesn't seem to notice.`,
      options: [
        {
          text: 'Greet her again a little louder',
          nextText: 7
        },
        {
          text: 'Pinch just a bit of pancake to eat',
          nextText: 8
        },
      ]
    },
    {
      id: 7,
      text: `She was momentarily taken aback by your greeting and turns around to face you. "Oh! I didn't know you've waken up already!", she replies. Then, she quickly turns again to turn the stove's heat to the lowest setting and faces you once more to start singing Happy Birthday!`,
      options: [
        {
          text: `"Thanks Mom! I'm really excited to start eating those pancakes!"`,
          nextText: 9
        },
        {
          text: `"Thanks Mom! I'm really excited to finally have my very first Pokemon!"`,
          nextText: 9
        },
        {
          text: `"Thanks Mom! I'm just excited for my friends to come over and celebrate!"`,
          nextText: 9
        }
      ]
    },
    {
      id: 8,
      text: `You tear just a small piece from the pancake just to get a taste. After taking a quick bite, your mom turns around to face you. "Oh! I didn't know you've waken up already!", she replied. "Were you surprised to see pancakes with your favorite maple syrup brand?", she asked and chuckles a bit. Then, she quickly turns again, facing the stove and changes the heat to its lowest setting. She faces you once more to start singing Happy Birthday!`,
      options: [
        {
          text: `"Thanks Mom! I'm really excited to eat more pancakes!"`,
          nextText: 9
        },
        {
          text: `"Thanks Mom! I'm really excited to finally have my very first Pokemon!"`,
          nextText: 9
        },
        {
          text: `"Thanks Mom! I'm just excited for my friends to come over and celebrate!"`,
          nextText: 9
        },
      ]
    },
    {
      id: 9,
      text: `"Of course, before doing anything else, we should eat some breakfast first!", she exclaimed. "I'm sure you're very hungry right now", she continued. "Don't worry! I'm sure Prof. Oak will let us know when you should come to visit him, and all your friends will be here soon!"`,
      options: [
        {
          text: `Eat breakfast`,
          nextText: 10
        }
      ]
    },
    {
      id: 10,
      text: `You sit beside your mom and start eating breakfast together. Your mom tells you that your dad has called earlier to greet you a happy birthday, but you were still fast asleep around that time. She says that he'll start calling again later today, and you tell your mom how excited you are to get your very first Pokemon. You begin to wonder what type of POKEMON it'll be, and then you start to remember that your friend, MAX, might get his first POKEMON around the same time that you will.`,
      options: [
        {
          text: "Continue",
          nextText: 11
        }
      ]
    },
    {
      id: 11,
      text: `You've been friends with MAX ever since you were in preschool. He's always been among the top students in classes, and he knows all about POKEMON. He is the youngest Poketrivia champion, and you've always viewed him as a walking POKEMON encyclopedia!`,
      options: [
        {
          text: "Continue",
          nextText: 12
        }
      ]
    },
    {
      id: 12,
      text: `After eating breakfast, you and your mom continue to chit-chat a little bit more about your dad. Your dad is one of the most respected and well-known POKEMON DETECTIVES within the whole KANTO region. He is known for uncovering one of TEAM ROCKET'S hidden bases and rescuing 50 SLOWPOKES.`,
      options: [
        {
          text: "What's Team Rocket?",
          nextText: 13
        },
        {
          text: "What's a Slowpoke?",
          nextText: 14
        },
        {
          text: "Continue",
          nextText: 15
        },
        
      ]
    },
    {
      id: 13,
      text: `TEAM ROCKET is a notorious criminal organization whose primary objective is to steal all the POKEMON and rule the world.`,
      options: [
        {
          text: "What's a Slowpoke?",
          nextText: 14
        },
        {
          text: "Continue",
          nextText: 15
        }
      ]
    },
    {
      id: 14,
      text: `You first learned from school that a SLOWPOKE is a type of WATER and PSYCHIC POKEMON. Although SLOWPOKES are quite common and intellectually slow, their tails are highly valuable in black markets. TEAM ROCKET is after their tails solely for profit to become more powerful.`,
      options: [
        {
          text: "What's Team Rocket?",
          nextText: 13
        },
        {
          text: "Continue",
          nextText: 15
        }
      ]
    },
    {
      id: 15,
      text: `If it weren't for your DAD, those SLOWPOKES would forever become hostages in TEAM ROCKET'S secret hideout since SLOWPOKES have the ability to grow back their tails. Your DAD was later awarded by the mayor for his heroic discovery and immediately promoted to become the LEAD POKEMON DETECTIVE. Although you and your MOM are extremely proud of your DAD, you both also miss him a lot.`,
      options: [
        {
          text: "Continue",
          nextText: 16
        }
      ]
    },
    {
      id: 16,
      text: `As the LEAD POKEMON DETECTIVE, your DAD is often assigned to handle difficult and dangerous cases all across different regions and countries. Currently, your DAD is temporarily staying in AUSTRALIA to solve the mystery about changes in PELIPPERS' migration patterns.`, 
      options: [
        {
          text: "What are PELIPPERS?",
          nextText: 17
        },
        {
          text: "Continue",
          nextText: 18
        },
      ]
    },
    {
      id: 17,
      text: `A PELIPPER is a FLYING and WATER type of POKEMON that closely resembles a pelican. It is said that there are more PELIPPERS than the entire human population in Australia. They are so common that Australia is now considering to make PELIPPERS as their national POKEMON.`, 
      options: [
        {
          text: "Continue",
          nextText: 18
        },
      ]
    },
    {
      id: 18,
      text: `Your dad is your biggest hero, and that's part of the reason why you want to become the very best POKEMON trainer. You want to travel around the world like your dad and to become a POKEMON CHAMPION, which is the highest level that a POKEMON TRAINER can attain. As you and your MOM continue to discuss about your DAD's adventures, your conversation is cut short by the sound of the telephone loudly ringing.`, 
      options: [
        {
          text: "Continue",
          nextText: 19
        },
      ]
    },
    {
      id: 19,
      text: `Your MOM picks up the phone, and you recognize PROF. OAK's voice by the faint telephone sounds. "Sure, PROF. OAK", your MOM says as she smiles and faces you. She pulls the telephone just a few inches away from her ear. "PROF. OAK has a special request for you, and he wants you to go to his lab right at this very instant. Are you available to do that?"`, 
      options: [
        {
          text: "I've waited for this day ever since I was born in this world!",
          nextText: 20
        }
      ]
    },
    {
      id: 20,
      text: `Your MOM chuckles and presses the telephone receiver back on her ear. She informs PROF. OAK about your response and enthusiasm to take on this special request. You recognized immediately that this special request is to start choosing your first POKEMON. You are overfilled with overwhelming excitement yet again, and dash off to quickly change your clothes. You greet your mom with a goodbye and start heading outside to meet the professor.`, 
      options: [
        {
          text: "Leave house",
          nextText: 21
        }
      ]
    },
    {
      id: 21,
      text: `After stepping outside the door, you rush towards your bicycle and start pedalling to PROF. OAK's lab. His lab is only a few blocks away from your home, so you know you'll reach your destination in under five minutes. Your mind is quickly filled by thoughts of different POKEMON you could get. You don't really have a particular favorite Pokemon, so you know you'd completely love and accept any Pokemon you'll get.`, 
      options: [
        {
          text: "Reach Prof. Oak's lab",
          nextText: 22,
        }
      ]
    },
    {
      id: 22,
      text: `Finally! You've reached Prof. Oak's lab! It's a pretty simple lab as it was once a barn for Mareep (sheep Pokemon). Prof. Oak and the previous property owner were very good friends until the previous owner soon had to retire from tending sheep, and he had decided to hand over the property rights to Pro. Oak because of their strong friendship. You press the doorbell for a few seconds, and the door opens to reveal Prof. Oak's grandson, Gary, standing in front of you.`, 
      options: [
        {
          text: "Greet Gary",
          nextText: 23,
        }
      ]
    },
    {
      id: 22,
      text: `"Well hey, looks like a wild loser has appeared!", Gary replies. Gary has never been the friendliest guy, but you always do your best to at least be civilized enough to greet him, especially since he's the one who opened the entrance door for you. But, your face can't help but show annoyance to his comment. He suddenly starts to burst in laughter. "I was just playing with you!"`, 
      options: [
        {
          text: "Very funny Gary. Ha. Ha.",
          nextText: 23,
        }
      ]
    },
    {
      id: 23,
      text: `"Oh, come on! As if I'm going to ruin the day by talking to you! Besides, we're both getting our first Pokemon at the same time as Gramps says. I've been waiting for this day for all my life to finally beat you and everyone else to be the best Pokemon trainer ever!"`, 
      options: [
        {
          text: "Ignore and hit him with the silent treatment.",
          nextText: 24,
        },
        {
          text: "You're getting it all wrong. I'll be the one beating you!",
          nextText: 25,
        }
      ]
    },
    {
      id: 24,
      text: `Just as Gary mentioned, you also can't afford to ruin your birthday by letting him get to you. You hit him with the silent treatment. He didn't like that at all and starts insulting you again. You continue ignoring him until he gives up and heads inside his Grandpa's lab again.`, 
      options: [
        {
          text: "Go look for Prof. Oak",
          nextText: 26,
        }
      ]
    },
    {
      id: 25,
      text: `Gary didn't like that comment at all and starts bragging about the small Pokemon contests he has participated in. He has lost in all of those contests, but he still feels he's superior compared to other kids his age for having the guts to join in these contests without having a Pokemon. You tell him how you have no time for this non-sense, and he gives up and makes way for you to pass through the entrance door.`, 
      options: [
        {
          text: "Go look for Prof. Oak",
          nextText: 26,
        }
      ]
    },
    {
      id: 26,
      text: `You scan your surroundings and to your right, you see scientists and trainers using some of the lab's machines and apparatuses. To your left, you see several Pokemon inside some large dome-shaped machines with glass doors, while the other Pokemon are using exercise machines. Some of the bipedal Pokemon are running on treadmills, designed specifically to test their agility. "Are you ready to choose a Pokemon?"`, 
      options: [
        {
          text: `Yes Prof. Oak!!!`,
          nextText: 27,
        }
      ]
    },
    {
      id: 27,
      text: `You've been distracted by the Pokemon exercising that you didn't even hear Prof. Oak approaching you. He stands in front of you smiling and says, "Right this way please." You can't help but feel both extremely excited and nervous at the same time.`, 
      options: [
        {
          text: `Follow Prof. Oak`,
          nextText: 28,
        }
      ]
    },
    {
      id: 28,
      text: `You follow Prof. Oak and he leads you by walking straight ahead, and occassionally stopping by to be greeted by the other scientists or trainers. You reach the upper-right corner of the lab and see a large table with three Pokeballs.`, 
      options: [
        {
          text: `Continue`,
          nextText: 29,
        }
      ]
    },
    {
      id: 29,
      text: `Take a peek inside each of the Pokeballs in front of you and go ahead and start choosing one!`, 
      options: [
        {
          text: `Examine each Pokeball`,
          nextText: 30,
        }
      ]
    },
    {
      id: 30,
      text: `Inside the first Pokeball on the left is a green Bulbasaur! A Bulbasaur is a grass-type Pokemon, which means it's effective against water-type Pokemon but very weak against fire types. You also see a tiny blue Squirtle in the center Pokeball. A Squirtle is a water-type Pokemon that's powerful against fire types but weak against grass types. And finally, to your right, is an orange Charmander with its flaming tail. Charmanders are fire type in nature and are strong against grass-types and weak against water. So what will you choose?`, 
      //image: ,
      options: [
        {
          text: `Bulbasaur!`,
          setState: {Bulbasaur: true, Squirtle: false, Charmander: false, grass: true, water: false, fire: false},
          nextText: 31,
        },
        {
          text: `Squirtle!`,
          setState: {Bulbasaur: false, Squirtle: true, Charmander: false, grass: false, water: true, fire: false},
          nextText: 32,
        },
        {
          text: `Charmander!`,
          setState: {Bulbasaur: true, Squirtle: false, Charmander: false, grass: false, water: false, fire: true},
          nextText: 33,
        },
      ]
    },
    {
      id: 31,
      text: `Good choice! Your Bulbasaur leaps out of its Pokeball because of joy, and you carry it in your arms and start petting its back. "Saur!", your Bulbasaur exlaims, and you knew immediately it has taken a fond liking of you.`, 
      image: "/finalProject/bulbasaur.png",
      options: [
        {
          text: `Bulbasaur!`,
          nextText: 34,
        },
      ]
    },
    {
      id: 32,
      text: `Good choice! Your Squirtle leaps out of its Pokeball because of joy, and you carry it in your arms and start rubbing its belly. "Squirtle!", your Bulbasaur exclaims, and you knew immediately it has taken a fond liking of you.`, 
      //image: "/finalProject/bulbasaur.png",
      options: [
        {
          text: `Continue`,
          nextText: 34,
        },
      ]
    },
    {
      id: 33,
      text: `Good choice! Your Charmander leaps out of its Pokeball because of joy, and you carry it in your arms and start patting its head. "Char!", your Charmander exclaims, and you knew immediately it has taken a fond liking of you.`, 
      //image: "/finalProject/bulbasaur.png",
      options: [
        {
          text: `Bulbasaur!`,
          nextText: 34,
        },
      ]
    },
    {
      id: 34,
      text: `"You've made an excellent choice! And it looks like your Pokemon likes you a lot already!", Prof. Oak says. "Make sure to always take care of your Pokemon and help it get stronger by feeding it with berries it likes and letting it battle with other Pokemon too! As for the rest of the Pokeballs, I'll be handing them to the other new trainers, so they can also choose which Pokemon they like." Just then, your Pokemon disappears and goes back to its Pokeball! It looks like it got startled by something!`, 
      //image: "/finalProject/bulbasaur.png",
      options: [
        {
          text: `Continue`,
          nextText: 35,
        },
      ]
    },
    {
      id: 35,
      text: `"Stop right there!" You hear someone shouting behind you. "Gramps! I also want a Pokemon! It's not fair, and I should've been the first one to choose!", you turn around and realize it was Gary shouting. "Now, now, Gary. Be patient to wait for your turn. But you can also start choosing now." Gary, turns to you and asks you what Pokemon you've chosen.`,
      options: [
        {
          requiredState: (currentState) => currentState.Bulbasaur,
          text: `Bulbasaur`,
          nextText: 37,
        },
        {
          requiredState: (currentState) => currentState.Squirtle,
          text: `Squirtle`,
          nextText: 38,
        },
        {
          requiredState: (currentState) => currentState.Charmander,
          text: `Charmander`,
          nextText: 39,
        },
        {
          text: `As if I should tell you..`,
          nextText: 36,
        }
      ]
    },
    {
      id: 36,
      text: `"Hmph! I was just curious, no need to be so rude!" After Gary says that, you start to feel quite bad..`,
      options: [
        {
          requiredState: (currentState) => currentState.Bulbasaur,
          text: `Bulbasaur`,
          nextText: 37,
        },
        {
          requiredState: (currentState) => currentState.Squirtle,
          text: `Squirtle`,
          nextText: 38,
        },
        {
          requiredState: (currentState) => currentState.Charmander,
          text: `Charmander`,
          nextText: 39,
        }
      ]
    },
    {
      id: 37,
      text: `"Never knew you had a great taste in strong Pokemon. Well in that case... Gramps I'll be taking the Charmander!`,
      options: [
        {
          text: `"Hey, that's not f—"`,
          nextText: 40,
        },
      ]
    },
    {
      id: 38,
      text: `"Never knew you had a great taste in strong Pokemon. Well in that case... Gramps I'll be taking the Bulbasaur!`,
      options: [
        {
          text: `"Hey, that's not f—"`,
          nextText: 41,
        },
      ]
    },
    {
      id: 37,
      text: `"Never knew you had a great taste in strong Pokemon. Well in that case... Gramps I'll be taking the Squirtle!"`,
      options: [
        {
          text: `"Hey, that's not f—"`,
          nextText: 42,
        },
      ]
    },
    {
      id: 40,
      text: `But before you could finish your sentence, he quickly grabs the Pokeball containing the Charmander. The Charmander leaps out of its Pokeball just like what you first witnessed when you claimed your Pokemon. "I don't approve what you've done Gary, but it looks like the Charmander now recognizes you as its owner", Prof. Oak explains. The Charmander spreads both of its arms open and faces Gary as if it were trying to hug him. "Dude, save the hugs for later, first we have to battle our #1 hater!"`,
      options: [
        {
          text: `"Wait.. are you talking about me?"`,
          nextText: 43,
        },
        {
          text: `"Bring it on!"`,
          nextText: 44,
        },
      ]
    },
    {
      id: 41,
      text: `But before you could finish your sentence, he quickly grabs the Pokeball containing the Bulbasaur. The Bulbasaur leaps out of its Pokeball just like what you first witnessed when you claimed your Pokemon. "I don't approve what you've done Gary, but it looks like the Bulbasaur now recognizes you as its owner", Prof. Oak explains. The Bulbasaur spreads both of its arms open and faces Gary as if it were trying to hug him. "Dude, save the hugs for later, first we have to battle our #1 hater!"`,
      options: [
        {
          text: `"Wait.. are you talking about me?"`,
          nextText: 43,
        },
        {
          text: `"Bring it on!"`,
          nextText: 44,
        },
      ]
    },
    {
      id: 42,
      text: `But before you could finish your sentence, he quickly grabs the Pokeball containing the Squirtle. The Squirtle leaps out of its Pokeball just like what you first witnessed when you claimed your Pokemon. "I don't approve what you've done Gary, but it looks like the Squirtle now recognizes you as its owner", Prof. Oak explains. The Squirtle spreads both of its arms open and faces Gary as if it were trying to hug him. "Dude, save the hugs for later, first we have to battle our #1 hater!"`,
      options: [
        {
          text: `"Wait.. are you talking about me?"`,
          nextText: 43,
        },
        {
          text: `"Bring it on!"`,
          nextText: 44,
        },
      ]
    },
    {
      id: 43,
      text: `"Obviously! Who else would I be talking about?" His Pokemon starts facing you and changes its position to a battle stance. "I may not agree with most of Gary's antics, but I think it'll be a good idea for you to practice battling with your Pokemon", you hear Prof. Oak tell you.`,
      options: [
        {
          text: `"Enter battle!"`,
          nextText: 45,
        },
      ]
    },
    {
      id: 44,
      text: `His Pokemon starts facing you and changes its position to a battle stance. "This is a great opportunity for you to practice battling with your Pokemon", you hear Prof. Oak tell you.`,
      options: [
        {
          text: `"Enter battle!"`,
          nextText: 45,
        },
      ]
    },
    {
      id: 45,
      text: `Your Pokemon comes out of its Pokeball again, looking confident and ready to face Gary's Pokemon. Since your Pokemon outspeeds Gary's you choose your first move. You start thinking of an attack, then suddenly... *Poof!* "What the—?", you think to yourself.`,
      options: [
        {
          text: `Gary's Pokemon just disappeared!`,
          nextText: 46,
        },
      ]
    },
    {
      id: 46,
      text: `You examine the room and find out you were right. Gary's Pokemon just disappeared while you were thinking of a battle move for your Pokemon to do. "Whaaaaaattt!?", Gary screams. "Where's my Pokemon!? Gramps, you must know where it went!" Gary starts to take a look inside his Pokeball, but the look of his face tells you that it's not there either.`, 
      options: [
        {
          text: `Continue`,
          nextText: 47,
        },
      ]
    },
    {
      id: 47,
      text: `You start looking inside your Pokeball too in case it snuck in there, but you find no trace of it there as well. Prof. Oak looks just as puzzled as both you and Gary are. "That's impossible! I also saw it disappear in an instant with my own eyes!" All of a sudden, you hear the sound of heavy footsteps rapidly approaching your direction. "Prof. Oak!!" you hear someone exclaim.`, 
      options: [
        {
          text: `Continue`,
          nextText: 48,
        },
      ]
    },
    {
      id: 48,
      text: `"We just received urgent news from the head researchers from the Hoenn region of five Pokemon suddenly disappearing!" you realize it's one of the scientists working alongside Prof. Oak in his lab. You start to panic inside after hearing the news, and you see that Gary looks as if he were about to cry.`, 
      options: [
        {
          text: `Continue`,
          nextText: 49,
        },
      ]
    },
    {
      id: 49,
      text: `Prof. Oak stays completely silent but his face also seems to be full of shock as his mouth is left wide open and his eyes, fixated on the spot where Gary's Pokemon was last seen. It takes about two seconds until Prof. Oak tries gathering himself again mentally. "We've also witnessed my grandson's Pokemon disappear" he replies nonchalantly, almost as if he was never surprised in the first place.`, 
      options: [
        {
          text: `Continue`,
          nextText: 50,
        },
      ]
    },
    {
      id: 50,
      text: `The scientist who first brought the news gasps after hearing what Prof. Oak said. "Did it disappear and vanish into thin air suddenly?" Prof. Oak nods. "I'm afraid we still don't know the cause behind it and where the Pokemon are", the scientist frowns while explaining.`, 
      options: [
        {
          text: `Continue`,
          nextText: 51,
        },
      ]
    },
    {
      id: 51,
      text: `"The only lead we have so far is that the disappearances are not exclusive to only one particular country. The first disappearance happened in Egypt, then in Canada, and it also happened in Australia just a minute ago. The rest of the disappearances happened in this country, but we can't seem to find a connection between all of the countries that have experienced this phenomenon."`, 
      options: [
        {
          text: `Did he say Australia too?`,
          nextText: 52,
        },
      ]
    },
    {
      id: 52,
      text: `After hearing him mention about Australia, you feel the urge to start calling your dad and asking him about this strange event. But, you decided against it since it looked like Prof. Oak was about to speak his mind, and you wanted to hear his response first.`, 
      options: [
        {
          text: `Continue`,
          nextText: 53,
        },
      ]
    },
    {
      id: 53,
      text: `"I'm certain there is a valid explanation behind all of these," Prof. Oak replied. "But we have to act quickly to find the missing Pokemon and to prevent other Pokemon from disappearing. I will contact the other brilliant researchers and scientists I know from other countries to sort this problem ASAP." Prof Oak then proceeds to come closer to Gary. "Gary, it'll be all right! Your Gramps will find your Pokemon and the rest of the missing Pokemon with the help of other scientists all over the world", he reassures Gary.`, 
      options: [
        {
          text: `Continue`,
          nextText: 54,
        },
      ]
    },
    {
      id: 54,
      text: `Prof. Oak's reassurance seemed to have helped lift up Gary's mood. He now looked determined to get his Pokemon back. "I'm sure you'll find it Gramps and the other people's Pokemon too, so I can finally show off my amazing Pokemon skills!", Gary responds.`, 
      options: [
        {
          text: `Agree with Gary`,
          nextText: 55,
        },
      ]
    },
    {
      id: 55,
      text: `Although Gary has always been your long-time rival, and well, everyone else's rival, you know that he's also as passionate as you when it comes to becoming a Pokemon trainer. You can't help but feel bad about his missing Pokemon and want to help him find it too. Gary smirks and tells you to look out for your Pokemon too or else he won't be able to beat it in a Pokebattle.`, 
      options: [
        {
          text: `Tell Prof. Oak you plan to give your dad a call`,
          nextText: 56,
        },
      ]
    },
    {
      id: 56,
      text: `Since you want to help search for the missing Pokemon, you let Prof. Oak and the other scientist know that you also plan to call your dad to see if the police already has a few leads about the situation. "That's a great idea!", the scientist says. "I agree! The first missing Pokemon was originally from Australia. The police might already be investigating it by now", Prof. Oak adds.`, 
      options: [
        {
          text: `Call your dad`,
          nextText: 57,
        },
      ]
    },
    {
      id: 57,
      text: `But before you even start to call your dad, you are surprised to see your phone ringing by a call from your dad! "Is your Pokemon still with you?", you hear your dad say as you answer his call immediately. You quickly explain to your dad everything that has happened. Your dad responds that the police are already in charge of solving the mystery as well. They've only just learned the news that it has started happening in other countries too. "If you don't mind, may I speak with your dad?" the scientist asks you.`, 
      options: [
        {
          text: `Hand phone to Prof. Oak`,
          nextText: 58,
        },
      ]
    },
    {
      id: 58,
      text: `The scientist begins to explain more about the news they've received about the recent disappearances.`, 
      options: [
        {
          text: `That's a relief then!`,
          nextText: -1,
        },
      ]
    },
  ]